app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `email` = 'estebannrodriguez28@gmail.com'
 LIMIT 1
---
    public function authenticate()
    {
        $session = session();
        $userModel = new UserModel();

        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $user = $userModel->where('email', $email)->first();