app/Controllers/Pago.php

INSERT INTO `ventas` (`idVenta`, `idUsuario`, `idDireccion`, `idTarjeta`, `totalPagar`, `fecha`) VALUES ('18689019', '9', '19', '14', '3180', '2023-05-14 19:47:03')
---
    public function RegistrarVenta(){
        $model = new VentasUsuario();
        $session = session();
        $user_id = $session->get('id');
        $idVenta = $this->request->getVar('numero_venta');
        $_SESSION['id_venta'] = $idVenta;
        $data = [
            'idVenta'    => $idVenta,
            'idUsuario'    => $user_id,
            'idDireccion'    => $this->request->getVar('direccionselect'),
            'idTarjeta'    => $this->request->getVar('tarjetaselect'),
            'totalPagar'    => $this->request->getVar('totalPagar'),

        ];
        $model->save($data);