app/Controllers/RegUsuario.php

    public function register()
    {
        $rules = [
            'email' => ['rules' => 'required|min_length[4]|max_length[255]|valid_email|is_unique[users.email]'],
            'password' => ['rules' => 'required|min_length[8]|max_length[255]'],
            'confirm_password'  => [ 'label' => 'confirm password', 'rules' => 'matches[password]']
        ];


        if($this->validate($rules)){
            $model = new UserModel();
            $data = [
                'email'    => $this->request->getVar('email'),
                'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT),
                'name'    => $this->request->getVar('name')
            ];
            $model->save($data);
---
INSERT INTO `users` (`email`, `password`, `name`, `user_created_at`) VALUES ('estebannrodriguez28@gmail.com', '$2y$10$XFsJbFvBzbGNUft76dMwHOuIJ1J9SDYdn4PcFK8Ci7ffBWOyiqzdm', 'Esteban', '2023-04-27 14:42:38')