app/Models/Carrito.php

    public function guardar_contenido($param){
        $this->insert($param);
---
INSERT INTO `carrito` (`idProducto`, `nombre`, `precio`, `stock`, `cantidad`) VALUES ('17', 'Sudadera Deportiva Lila Mujer', '499', '86', '1')