app/Models/Contenido.php

INSERT INTO `contenido` (`idPaquete`, `codigo`) VALUES (14, '<div class=\'col-lg-4 col-md-4 col-sm-12\' style=\'backgrund-color:grey; padding: 2%;\'>\r\n                                 <div class=\'card h-100 p-4\'>\r\n                                   <div class=\'card-body text-center\' style=\'padding:0px; margin:0px;\'>\r\n                                     <h4 class=\'card-title mb-0 p-2\'>Paquete prueba</h4>\r\n                                     <p><strong>Fecha Inicio: </strong>2023-03-13</p>\r\n                                     <p><strong>Fecha Termino: </strong>2023-03-16</p>\r\n                                     <p class=\'regalo-promo\'>¡Llevate algo chido de regalo!</p>\r\n                                     <h2>$5677</h2>\r\n                                     <br>\r\n                                     <br>\r\n                                   </div>\r\n                                   <div class=\'card-footer text-center\' style=\'border: none; background-color: transparent; padding:5px; margin:5px;\'>  \r\n                                     <a class=\'btn btn-primary btn-promos\'>Comprar</a>\r\n                                   </div>\r\n                                 </div>\r\n                               </div>')
---
    public function guardar_contenido($param){
        $this->insert($param);