app/Models/PackProductos.php

SELECT *
FROM `detalle_paquete`
JOIN `productos` ON `productos`.`idProducto` = `detalle_paquete`.`idProducto`
WHERE `idPaquete` = '7'
---
    public function getProductosRelacionados($idPaquete)
    {
        $builder = $this->db->table('detalle_paquete');
        $builder->select('*');
        $builder->join('productos', 'productos.idProducto = detalle_paquete.idProducto');
        $builder->where('idPaquete', $idPaquete);
        $result = $builder->get()->getResultArray();