app/Models/Paquetes.php

INSERT INTO `paquetes` (`nombre`, `descripcion`, `fechaInicio`, `fechaTermino`, `estado`, `precio`) VALUES ('Paquete prueba', '¡Llevate algo chido de regalo!', '2023-03-13', '2023-03-16', 'Activo', '5677')
---
    public function guardar_paquete($param){
        $this->insert($param);